---
kind: method
id: M:Autodesk.Revit.DB.PointCloudType.GetPath
source: html/0705dfa3-03c4-12ff-b2ef-7dfae8fa768b.htm
---
# Autodesk.Revit.DB.PointCloudType.GetPath Method

Gets the path of the link source from which the points are loaded.

## Syntax (C#)
```csharp
public ModelPath GetPath()
```

## Returns
Returns the file path for a file based point cloud or null for the non-file based point cloud.